Repository: robot-xliff-farmer/mapsapi-examples
Catalog: mapsapi-examples.tmx
Source language: ru
Languages: en

source: Смещение левого верхнего угла иконки относительно её "ножки" (точки привязки).
en: The offset of the upper left corner of the icon relative to its "tail" (the anchor point).

source: params - параметры маршрутизации (например, тип маршрутизации, учет пробок и др.).
en: params - Routing parameters (for example, the type of routing, consider traffic, and so on).

source: опции маршрутизатора. В опциях задаются правила отображения маршрутов на карте.
en: router options. The options specify rules for displaying routes on the map.

source: Примеры. Построение автомобильного мультимаршрута
en: Examples. Building a driving multiroute

source: Создаем мультимаршрут. Первым аргументом передаем модель либо объект описания модели. Вторым аргументом передаем опции отображения мультимаршрута.
en: Creating a multiroute. The first argument passes either the model or object description model. The second argument passes the multiroute display options.

source: Описание опорных точек мультимаршрута.
en: The description of the reference points on the multi-stop route.

source: Параметры маршрутизации.
en: Routing options.

source: Ограничение на максимальное количество маршрутов, возвращаемое маршрутизатором.
en: Limit on the maximum number of routes returned by the router.

source: Создаем кнопки для управления мультимаршрутом.
en: Creating buttons for controlling the multiroute.

source: Объявляем обработчики для кнопок.
en: Declaring handlers for the buttons.

source: Задаем параметры маршрутизации для модели мультимаршрута.
en: Setting routing parameters for the multiroute model.

source: Добавляем транзитную точку в модель мультимаршрута. Обратите внимание, что транзитные точки могут находится только между двумя путевыми точками, т.е. не могут быть крайними точками маршрута.
en: Adding a throughpoint to the multiroute model. Note that throughpoints can only be placed between two waypoints. In other words, they can't be end points on a route.

source: Создаем карту с добавленными на нее кнопками.
en: Creating the map with buttons added to it.

source: Поиск станций метро.
en: Search metro stations.

source: Ищем только станции метро.
en: Only looking for a metro station.

source: Запрашиваем не более 20 результатов.
en: Requesting no more than 20 results.

source: Задаем изображение для иконок меток.
en: Setting the image for placemark icons.

source: Добавляем коллекцию найденных геообъектов на карту.
en: Adding a collection of found geo objects to the map.

source: Масштабируем карту на область видимости коллекции.
en: Zooming the map to the collection's viewport.

source: Примеры. Обратное геокодирование
en: Examples. Reverse geocoding

source: Примеры. Список объектов карты.
en: Examples. A list of map objects.

source: Контейнер для меню.
en: The container for the menu.

source: Пункт меню.
en: A menu item.

source: Коллекция для геообъектов группы.
en: Collection for geo objects in a group.

source: Контейнер для подменю.
en: The container for the submenu.

source: Добавляем коллекцию на карту.
en: Adding a collection to the map.

source: Добавляем подменю.
en: Adding a submenu.

source: Добавляем пункт в меню.
en: Adding a menu item.

source: По клику удаляем/добавляем коллекцию на карту и скрываем/отображаем подменю.
en: On click, removing/adding the collection to the map and hiding/displaying the submenu.

source: Пункт подменю.
en: A submenu item.

source: Добавляем метку в коллекцию.
en: Adding a placemark to the collection.

source: Добавляем пункт в подменю.
en: Adding an item to the submenu.

source: При клике по пункту подменю открываем/закрываем баллун у метки.
en: When an item in the submenu is clicked, we open/close the placemark balloon.

source: Добавляем меню в тэг BODY.
en: Adding the menu to the BODY tag.

source: Выставляем масштаб карты чтобы были видны все группы.
en: Setting the map zoom so all groups are visible.

source: Группы объектов
en: Groups of objects

source: Примеры. Загрузка геоданных с помощью jQuery.
en: Examples. Loading geo data using jQuery.

source: Сохраним ссылку на геообъекты на случай, если понадобится какая-либо постобработка.
en: Saving a reference to the geo objects in case any postprocessing is necessary.

source: Примеры. Пользовательский макет выпадающего списка.
en: Examples. Custom drop-down list layout

source: Создадим собственный макет выпадающего списка.
en: Creating a custom drop-down list layout.

source: Этот элемент будет служить контейнером для элементов списка. В зависимости от того, свернут или развернут список, этот контейнер будет скрываться или показываться вместе с дочерними элементами.
en: This element will serve as a container for list items. Depending on whether the list is expanded or collapsed, this container will be hidden or shown together with its child elements.

source: Вызываем метод build родительского класса перед выполнением дополнительных действий.
en: Calling the build method of the parent class before performing additional actions.

source: Генерируем специальное событие, оповещающее элемент управления о смене контейнера дочерних элементов.
en: Generating a special event that notifies the control of changes to the child element container.

source: Переопределяем интерфейсный метод, возвращающий ссылку на контейнер дочерних элементов.
en: Overriding the interface method that returns a reference to the child element container.

source: Заставим элемент управления перед очисткой макета откреплять дочерние элементы от родительского. Это защитит нас от неожиданных ошибок, связанных с уничтожением dom-элементов в ранних версиях ie.
en: Forcing the control to remove child elements from the parent before cleaning the layout. This will protect us from unexpected errors associated with the destruction of DOM elements in earlier versions of IE.

source: Вызываем метод clear родительского класса после выполнения дополнительных действий.
en: Calling the "clear" method of the parent class after performing additional actions.

source: Также создадим макет для отдельного элемента списка.
en: Also creating a layout for a separate list item.

source: Создадим 2 пункта выпадающего списка
en: Creating two items in a drop-down list

source: Теперь создадим список, содержащий 2 пунтка.
en: Now we'll create a list containing the two items.

source: С помощью опций можно задать как макет непосредственно для списка,
en: You can use options to specify the layout directly for the list,

source: так и макет для дочерних элементов списка. Для задания опций дочерних элементов через родительский элемент необходимо добавлять префикс 'item' к названиям опций.
en: or the layout for the child elements of the list. To define options for child elements through the parent element, add the 'item' prefix to option names.

source: Получаем ссылку на объект, по которому кликнули. События элементов списка пропагируются и их можно слушать на родительском элементе.
en: Getting a reference to the clicked object. List item events propagate and can be listened to on the parent element.

source: Клик на заголовке выпадающего списка обрабатывать не надо.
en: A click on the drop-down list title does not need to be processed.

source: Мы хотим загружать данные для балуна перед открытием, поэтому запретим автоматически открывать балун по клику.
en: We want to load data for a balloon before opening, so we disable automatically opening the balloon on click.

source: Функция, эмулирующая запрос за данными на сервер.
en: Function that emulates a request for data to the server.

source: Устанавливаем стандартный макет балуна кластера "Карусель".
en: Setting the "Carousel" standard layout for a cluster balloon.

source: Устанавливаем максимальное количество элементов в нижней панели на одной странице
en: Setting the maximum number of items in the bottom panel on one page

source: Настройка внешего вида нижней панели. Режим marker рекомендуется использовать с небольшим количеством элементов. clusterBalloonPagerType: 'marker', Можно отключить зацикливание списка при навигации при помощи боковых стрелок. clusterBalloonCycling: false, Можно отключить отображение меню навигации. clusterBalloonPagerVisible: false
en: Configuring external view of the bottom panel. The marker mode is recommended for use with a small number of elements. clusterBalloonPagerType: 'marker', You can disable cycling the list when navigating using the side arrows. clusterBalloonCycling: false, You can disable displaying the navigation menu. clusterBalloonPagerVisible: false

source: Примеры. Кастомизация макета балуна кластера "Карусель".
en: Examples. Customization of the "Carousel" cluster balloon layout.

source: API Яндекс.Карт позволяет загружать XML-файлы с географическими данными в форматах YMapsML и KML.
en: The Yandex.Maps API allows you to load XML files with geographic data in YMapsML and KML formats.

source: Для загрузки данных используется функция [#$dp11].
en: To load data, use the [#$dp11] function.

source: Отключение кеширования атрибута disabled в Firefox.
en: Disabling caching the "disabled" attribute in Firefox.

source: При нажатии на кнопку загружаем соответствующий XML-файл. и отображаем его данные на карте.
en: When the button is clicked, we load the appropriate XML file and display its data on the map.

source: Обработчик загрузки XML-файлов.
en: The handler for loading XML files.

source: Примеры. Отображение YMapsML, KML на карте
en: Examples. Displaying YMapsML and KML on the map

source: Показать пример YMapsML
en: Show example of YMapsML

source: Показать пример KML
en: Show example of KML

source: Примеры. Многоугольник
en: Examples. Polygon

source: Многоугольник представляет собой замкнутую фигуру, состоящую из набора последовательно соединённых вершин. Многоугольник может иметь внутренние контуры.
en: A polygon is a closed shape consisting of a set of sequentially connected vertices. A polygon can have internal contours.

source: Многоугольник может быть создан двумя способами: с помощью класса GeoObject с указанием типа геометрии "Многоугольник" либо с помощью вспомогательного класса Polygon.
en: A polygon can be created in two ways: using the GeoObject class with the "Polygon" geometry type, or using the Polygon auxiliary class.

source: При создании многоугольника необходимо указать координаты его вершин. Также могут быть заданы свойства (например содержимое балуна или хинта) и опции (например цвет заливки или стиль контура) многоугольника.
en: When creating a polygon, you must specify the coordinates of its vertices. You can also set the properties (for example the contents of a balloon or hint) and options (such as fill color or contour style) of the polygon.

source: Для многоугольников доступен визуальный редактор. Ссылка на редактор содержится в поле editor объекта-многоугольника.
en: A visual editor is available for polygons. A link to the editor is in the editor field of the polygon object.

source: Многоугольники, наряду с другими геообъектами, можно объединять в коллекции.
en: Polygons, like other geo objects, can be combined in collections.

source: Создаем многоугольник, используя класс GeoObject.
en: Creating a polygon using the GeoObject class.

source: Тип геометрии - "Многоугольник".
en: The "Polygon" geometry type.

source: Указываем координаты вершин многоугольника.
en: Specifying the coordinates of the vertices of the polygon.

source: Координаты вершин внешнего контура.
en: The coordinates of the vertices of the external contour.

source: Задаем правило заливки внутренних контуров по алгоритму "nonZero".
en: Setting the fill rule for internal contours using the "nonZero" algorithm.

source: Описываем опции геообъекта. Цвет заливки.
en: Describing the geo object options. Fill color.

source: Общая прозрачность (как для заливки, так и для обводки).
en: The overall transparency (for both fill and stroke).

source: Стиль обводки.
en: The stroke style.

source: Создаем многоугольник, используя вспомогательный класс Polygon.
en: Creating a polygon using the Polygon auxiliary class.

source: Указываем координаты вершин многоугольника. Координаты вершин внешнего контура.
en: Specifying the coordinates of the vertices of the polygon. The coordinates of the vertices of the external contour.

source: Задаем опции геообъекта. Цвет заливки.
en: Setting geo object options. Fill color.

source: Создадим элемент управления "Пробки".
en: Creating the "Traffic" control.

source: Отображаются пробки "Сейчас".
en: Displaying traffic "Now".

source: Начинаем сразу показывать пробки на карте.
en: Begin immediately showing traffic on the map.

source: Добавим контрол на карту.
en: Adding the control to the map.

source: Получим ссылку на провайдер пробок "Сейчас" и включим показ инфоточек.
en: Getting a reference to the "Now" traffic provider and enabling the display of information points.

source: Примеры. Элементы управления "Пробки"
en: Examples. "Traffic" control

source: Взаимодействие карты с пользователем программируется с помощью поведений.
en: Interaction between the map and the user is programmed using behaviors.

source: Поведения карты контролируются менеджером поведений. Cоздавать экземпляры этого класса самостоятельно не следует. Ссылка на менеджер поведений находится в поле behaviors объекта карты.
en: The map behaviors are controlled by the behaviors manager. You should not have to create instances of this class.. A reference to the behaviors manager is in the behaviors field of the map object.

source: Санкт-Петербург
en: St. Petersburg

source: Отключаем часть включенных по умолчанию поведений:
en: Disabling some of the behaviors enabled by default:

source: drag - перемещение карты при нажатой левой кнопки мыши;
en: drag - moving the map while holding down the left mouse button;

source: magnifier.rightButton - увеличение области, выделенной правой кнопкой мыши.
en: magnifier.rightButton - zooming in on the area selected with the right mouse button.

source: Включаем линейку.
en: Enabling the ruler.

source: Изменяем свойство поведения с помощью опции: изменение масштаба колесом прокрутки будет происходить медленно, на 1/2 уровня масштабирования в секунду.
en: Using options to change the property of a behavior: zooming with the scroll wheel will be slow, 1/2 zoom level per second.

source: Примеры. Поведения карты
en: Examples. Map behaviors

source: Каждому географическому объекту в YMapsML ставятся в соответствие геометрическая фигура и геообъект, используемый для отображения этой фигуры на карте. Описание фигур и их привязка к географическим координатам задаются в соответствующих YMapsML-элементах. Для фигуры "многоугольник" предназначен элемент gml:Polygon. Он содержит элемент gml:exterior, в котором перечисляются координаты вершин внешнего контура многоугольника. Также многоугольник может содержать внутренние контуры. Координаты их вершин задаются в элементе gml:interior.
en: In YMapsML, each geographical object is associated with a geometric shape and a geo object that is used for displaying this shape on the map. The shape definitions and their anchors to geographical coordinates are set in corresponding YMapsML elements. The gml:Polygon element is designated for the "polygon" shape. It contains the gml:exterior element, which lists the coordinates of the vertexes of the polygon's exterior contour. A polygon may also contain interior contours. Their vertexes are set in the gml:interior element.

source: Для загрузки YMapsML-данных предназначена функция [#$dp16]. После того как данные загрузятся, функция преобразует их в [#$dp17] и передает в качестве параметра функции-обработчику. Коллекцию геообъектов GeoObjectCollection можно отобразить на карте.
en: The [#$dp16] function is for loading YMapsML data. After data has loaded, the function converts the data to [#$dp17] and passes it to the handler function as a parameter. A GeoObjectCollection can be displayed on the map.

source: В данном примере создается пользовательский макет хинта геообъекта. Макет задается геообъекту через опции.
en: This example creates a custom hint layout for the geo object. The layout is set for the geo object via the options.

source: Для того чтобы хинт автоматически сдвигал свою позицию в случае выхода за пределы контейнера карты, необходимо в его макете переопределить метод getShape(). Данный метод должен возвращать текущие размеры макета хинта.
en: In order for the hint to automatically shift its position if it goes outside of the map container, redefine the getShape() method in its layout. This method should return the current size of the hint layout.

source: Примеры. Собственный макет хинта
en: Examples. Custom hint layout

source: Создание макета содержимого хинта. Макет создается через фабрику макетов с помощью текстового шаблона.
en: Creating a layout for hint content. The layout is created through the layout factory using a text template.

source: Определяем метод getShape, который будет возвращать размеры макета хинта. Это необходимо для того, чтобы хинт автоматически сдвигал позицию при выходе за пределы карты.
en: Defining the getShape method, which will return the size of the hint layout. This is necessary in order for the hint to automatically move its position when going off the map.

source: Примеры. Контекстное меню геообъекта
en: Examples. Geo object context menu

source: Вызовите контекстное меню на метке
en: Open the context menu on a placemark

source: Красная иконка, растягивающаяся под содержимое.
en: Red icon that stretches to fit content.

source: Контекстное меню, позволяющее изменить параметры метки. Вызывается при нажатии правой кнопкой мыши на метке.
en: The context menu allows you to change the placemark settings. It is opened by right-clicking the placemark.

source: Если меню метки уже отображено, то убираем его.
en: If the placemark menu is already displayed, remove it.

source: HTML-содержимое контекстного меню.
en: HTML content of the context menu.

source: Размещаем контекстное меню на странице
en: Putting a context menu on the page

source: Задаем позицию меню.
en: Setting the menu position.

source: Заполняем поля контекстного меню текущими значениями свойств метки.
en: Filling the fields of the context menu with the current values of the placemark properties.

source: При нажатии на кнопку "Сохранить" изменяем свойства метки значениями, введенными в форме контекстного меню.
en: When the "Save" button is clicked, we change placemark properties to the values entered in the context menu form.

source: Удаляем контекстное меню.
en: Removing the context menu.

source: В данном примере для модели добавленного на карту мультимаршрута мы создаем еще одно пользовательское отображение. Данное отображение выводит краткое текстовое описание мультимаршурта и реагирует на изменение состояния модели. Пример иллюстрирует работу с событиями и данными модели мультимаршрута.
en: In this example, we create another custom view for the multiroute model added to the map. This representation displays a brief summary of the multiroute and reacts to a change in the model's state. The example shows how to work with a multiroute model's data and events.

source: Класс простого текстового отображения модели мультимаршрута.
en: Class for a simple textual view of the multiroute model.

source: Объявляем начальное состояние.
en: Declaring the initial state.

source: Элемент, в который будет выводиться текст.
en: The element the text will be displayed in.

source: Подписываемся на события модели, чтобы обновлять текстовое описание мультимаршрута.
en: Subscribing to model events in order to update the multiroute's text description.

source: Таблица соответствия идентификатора состояния имени его обработчика.
en: Mapping table for the state ID to its handler.

source: Таблица соответствия типа маршрута имени его обработчика.
en: Mapping table for the route type to its handler.

source: Обработчик событий модели.
en: Handler for model events.

source: Запоминаем состояние модели и перестраиваем текстовое описание.
en: Storing the model state and reconstructing the text description.

source: Берем из таблицы обработчик для текущего состояния и исполняем его.
en: Taking the handler for the current state from the table and executing it.

source: Берем из таблицы обработчик для данного типа маршрута и применяем его.
en: Taking the handler for this route type from the table and applying it.

source: Метод формирующий общую часть описания для обоих типов маршрутов.
en: Method that form the general part of the description for both types of routes.

source: Метод строящий список текстовых описаний для всех сегментов маршрута на общественном транспорте.
en: Method that constructs a list of text descriptions for all the segments of a route on public transport.

source: Создаем модель мультимаршрута.
en: Creating a multiroute model.

source: Создаем кнопку, переключающую модель в режим маршрутизации на общественном транспорте.
en: Creating a button that switches the model to routing on public transport.

source: Создаем экземпляр текстового отображения модели мультимаршрута. см. файл custom_view.js
en: Creating an instance of a textual display of the multiroute model. See the custom_view.js file.

source: Создаем на основе существующей модели мультимаршрут.
en: It will be based on the existing multiroute model.

source: Путевые точки можно перетаскивать. Маршрут при этом будет перестраиваться.
en: Waypoints can be dragged. The route adjusts when this happens.

source: Примеры. Работа с данными и событиями модели мультимаршрута
en: Examples. Working with the multiroute model data and events

source: В данном примере драггер используется для перетаскивания HTML-элемента "#marker". Этот HTML-элемент был передан как значение опции autoStartElement. Драггер автоматически запускается по событию mousedown элемента autoStartElement. Есть возможность инициализировать работу драггера вручную при помощи метода start(). Драггер прекращает работу по событию mouseup документа, но можно досрочно прекратить работу драггера методом stop().
en: In this example, the dragger is used for dragging the "#marker" HTML element. This HTML element was passed as the value of the autoStartElement option. The dragger is automatically started on the mousedown event of the autoStartElement. It is possible to initialize the dragger manually using the start() method. The dragger stops on the mouseup event of the document, but it is possible to terminate the dragger earlier using the stop() method.

source: Все события драггера содержат поля 'position' и 'delta', которые позволяют узнать текущее положение курсора и смещение текущего положения относительно последнего события драггера. В примере по событию stop происходит перевод положения маркера в геокоординаты, если драггер прекратил работу над картой.
en: All dragger events contain the fields 'position' and 'delta', which tell us the current cursor position and the offset of the current position relative to the last dragger event. In the example, when the stop event occurs, the marker position is converted to geocoordinates if the dragger has stopped working on the map.

source: Примеры. Использование драггера.
en: Examples. Using the dragger.

source: Перетащите метку на карту
en: Dragging the placemark to the map

source: Драггер будет автоматически запускаться при нажатии на элемент 'marker'.
en: Dragger will automatically run when the user clicks on the 'marker' element.

source: Смещение маркера относительно курсора.
en: The offset of the marker relative to the cursor.

source: Сохраняем смещение маркера относительно точки начала драга.
en: Saving the offset of the marker relative to the drag starting point.

source: Переводим координаты страницы в глобальные пиксельные координаты.
en: Converting page coordinates to global pixel coordinates.
